"""
while 条件：
    条件成立要重复执行的代码
    ......
"""
i = 0
while i<5:
    print("123456")
    i += 1
print(132456789)
print("-----------------------------------------")

#1-100数字累加和
sum=0
j=1
while j<=100:
    sum += j
    j +=1
print(sum)

print("-----------------------------------------")

#1-100 偶数 累加和

z = 1
result = 0
while z <= 100:
    if z % 2 == 0:
        result += z
    z += 1
print(result)
#方法二:1-100 偶数 累加和
#用计数器控制   让偶数累加       不建议使用

x=2
sum2=0
while x <=100:
    sum2 +=x
    x +=2
print(sum2)

print("-----------------------")

